entries/imadenale.org
#+hugo_base_dir: ../
#+startup: content
#+macro: latex @@html:<span class="latex">L<sup>A</sup>T<sub>E</sub>X</span>@@
#+options: ^:{}
#+macro: srclink (eval (org-hugo-get-link-to-orgfile "https://github.com/takaxp/blog/blame/master/entries/" "see Orgfile"))
#+link: files https://raw.githubusercontent.com/takaxp/takaxp.github.io/master/files

** DONE org-table.el のエコー表示を安定化                            :@emacs:
   CLOSED: [2020-06-12 Fri 10:28]
:PROPERTIES:
:EXPORT_FILE_NAME: 67fe3ac1-2dc0-f9f4-5973-caa0eb395bec
:EXPORT_HUGO_TAGS: "emacs" "org-mode" "org-table"
:EXPORT_HUGO_LASTMOD: 
:EXPORT_HUGO_IMAGES: 
:ID:       73AFD1B6-239A-45E0-9276-9D904DD6A6B6
:CREATED:  [2020-06-12 Fri 10:18]
:END:

私は普段から自動保存機能（[[http://0xcc.net/misc/auto-save/][auto-save-buffer.el]]）を利用しているので， org table のセルで ~C-c ?~ 押下でエコーエリアに表示される情報がすぐ消えてしまいます．

~org-table-field-info (C-c ?)~ は

#+begin_src
line @2, col $1, ref @2$1 or A2 or $LR1
#+end_src

のような情報をエコーエリアに出してくれる機能で， =tblfm= で指定する数式に使用します．（私が施している設定が主な要因で）これが自動保存時に消えるため，保存してからエコーエリアに表示するように変更します．

#+begin_src emacs-lisp
(defun ad:org-table-field-info (_arg)
  (save-buffer))
(advice-add 'org-table-field-info :before #'ad:org-table-field-info)
#+end_src

これで表示が消えなくなりました．簡単！

*** References
 - [[http://0xcc.net/misc/auto-save/][Emacsでファイルの自動保存 (auto-save-buffers)]]
 - [[https://takaxp.github.io/init.html#orgb8c01946][Configurations for GNU Emacs | 8.12 [auto-save-buffers.el] 一定間隔でバッファを保存する]]
 - [[https://github.com/ChillarAnand/real-auto-save][ChillarAnand/real-auto-save: Automatically save your all your buffers/files at regular intervals in Emacs!]]
