content/2020/67fe3ac1-2dc0-f9f4-5973-caa0eb395bec.md
+++
title = "org-table.el のエコー表示を安定化"
author = ["Takaaki ISHIKAWA"]
date = 2020-06-12T10:28:00+09:00
tags = ["emacs", "org-mode", "org-table"]
categories = ["emacs"]
draft = false
+++

私は普段から自動保存機能（[auto-save-buffer.el](http://0xcc.net/misc/auto-save/)）を利用しているので， org table のセルで `C-c ?` 押下でエコーエリアに表示される情報がすぐ消えてしまいます．

`org-table-field-info (C-c ?)` は

```nil
line @2, col $1, ref @2$1 or A2 or $LR1
```

のような情報をエコーエリアに出してくれる機能で， `tblfm` で指定する数式に使用します．（私が施している設定が主な要因で）これが自動保存時に消えるため，保存してからエコーエリアに表示するように変更します．

```emacs-lisp
(defun ad:org-table-field-info (_arg)
  (save-buffer))
(advice-add 'org-table-field-info :before #'ad:org-table-field-info)
```

これで表示が消えなくなりました．簡単！


## References {#references}

-   [Emacsでファイルの自動保存 (auto-save-buffers)](http://0xcc.net/misc/auto-save/)
-   [Configurations for GNU Emacs | 8.12 [auto-save-buffers.el] 一定間隔でバッファを保存する](https://takaxp.github.io/init.html#orgb8c01946)
-   [ChillarAnand/real-auto-save: Automatically save your all your buffers/files at regular intervals in Emacs!](https://github.com/ChillarAnand/real-auto-save)
